# ResList_GetSel

## Description
Return the selected item from the popup. The 'uniqueID' is a string identifier uniquely identifying this control.

```pascal
FUNCTION ResList_GetSel(uniqueID : STRING) : STRING;
```

```python

def vs.ResList_GetSel(uniqueID):
    return STRING
```

## Parameters
|Name|Type|Description|
|---|---|---|
|uniqueID|STRING||

## Version
Availability: from Vectorworks 2017
## Category
* Document List Handling